{
  "_name_or_path": "C:\\Users\\edesa\\.cache\\huggingface\\hub\\models--kandinsky-community--kandinsky-2-2-prior\\snapshots\\9fc51ad5732afc5d031724219d22e6c42179c5a8\\text_encoder",
  "architectures": [
    "CLIPTextModelWithProjection"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dropout": 0.0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_size": 1280,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 77,
  "model_type": "clip_text_model",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "pad_token_id": 1,
  "projection_dim": 1280,
  "torch_dtype": "float16",
  "transformers_version": "4.35.2",
  "vocab_size": 49408
}
